import time, random


def quick_sort(arr: list):
    if len(arr) <= 1:
        return arr

    # first, middle, last = arr[0], arr[len(arr) // 2], arr[-1]
    # pivot = sorted([first, middle, last])[1]
    # arr.remove(pivot)

    pivot = arr[len(arr) // 2]  # Выбираем середину в качестве опорного элемента

    left = []
    middle = []
    right = []

    for i in arr:
        if i < pivot:
            left.append(i)
        elif i == pivot:
            middle.append(i)
        else:
            right.append(i)

    # Рекурсивно сортируем левую и правую части, объединяем все вместе
    return quick_sort(left) + middle + quick_sort(right)


def merge_sorted_arrays(arr1, arr2):
    start_time = time.time()
    i, j = 0, 0  # два указателя
    result = []

    # Основной цикл: пока оба указателя в пределах массивов
    while i < len(arr1) and j < len(arr2):
        if arr1[i] <= arr2[j]:  #
            result.append(arr1[i])  #
            i += 1  #
        else:
            result.append(arr2[j])  #
            j += 1  #

    # Добавляем остатки первого массива, если они есть
    # при выхде за пределы массива в любом случае последний
    # элемент будет меньше чем первый из оставшихся элемеетов соседнего массива
    while i < len(arr1):
        result.append(arr1[i])
        i += 1

    # Делаем то же самое при окончании второго массива
    while j < len(arr2):
        result.append(arr2[j])
        j += 1

    end_time = time.time()  # присваиваем переменной время окончания итераций алгоритма
    elapsed_time = (
        end_time - start_time
    )  # получаем время затраченное на итерации алгоритма
    return result, f"Затраченное время : {elapsed_time:.4f} секунд", len(result)


def random_arrays():
    arr1 = [random.randint(1, 10000) for _ in range(1000000)]
    arr2 = [random.randint(10001, 20000) for _ in range(1000200)]
    return arr1, arr2


# неотсортированные массивы с временными метками unix time по 100 меток в каждом массиве
arr1 = [
    1733851023,
    1717524561,
    1728129345,
    1741234567,
    1709823456,
    1723456789,
    1712345678,
    1734567890,
    1729876543,
    1718765432,
    1736543210,
    1701234567,
    1722334455,
    1740987654,
    1711122334,
    1733210987,
    1725544332,
    1716655443,
    1737778889,
    1728899001,
    1709876543,
    1731234567,
    1714455667,
    1726677889,
    1740123456,
    1715566778,
    1738901234,
    1720011222,
    1713344556,
    1734455667,
    1727788990,
    1718899001,
    1704567890,
    1735678901,
    1721122334,
    1712233445,
    1736789012,
    1727890123,
    1718901234,
    1739012345,
    1723450123,
    1714561234,
    1735672345,
    1726783456,
    1717894567,
    1738905678,
    1729016789,
    1710127890,
    1731238901,
    1722349012,
    1713450123,
    1734561234,
    1725672345,
    1716783456,
    1737894567,
    1728905678,
    1719016789,
    1730127890,
    1721238901,
    1712349012,
    1733450123,
    1724561234,
    1715672345,
    1736783456,
    1727894567,
    1718905678,
    1739016789,
    1720128901,
    1711239012,
    1732340123,
    1723451234,
    1714562345,
    1735673456,
    1726784567,
    1717895678,
    1738906789,
    1729017890,
    1710128901,
    1731239012,
    1722340123,
    1713451234,
    1734562345,
    1725673456,
    1716784567,
    1737895678,
    1728906789,
    1719017890,
    1730128901,
    1721239012,
    1712340123,
    1733451234,
    1724562345,
    1715673456,
    1736784567,
    1727895678,
    1718906789,
    1739017890,
    1720128901,
]
arr2 = [
    1743851024,
    1727524562,
    1738129346,
    1751234568,
    1719823457,
    1733456790,
    1722345679,
    1744567891,
    1739876544,
    1728765433,
    1746543211,
    1711234568,
    1732334456,
    1750987655,
    1721122335,
    1743210988,
    1735544333,
    1726655444,
    1747778890,
    1738899002,
    1719876544,
    1741234568,
    1724455668,
    1736677890,
    1750123457,
    1725566779,
    1748901235,
    1730011223,
    1723344557,
    1744455668,
    1737788991,
    1728899002,
    1714567891,
    1745678902,
    1731122335,
    1722233446,
    1746789013,
    1737890124,
    1728901235,
    1749012346,
    1733450124,
    1724561235,
    1745672346,
    1736783457,
    1727894568,
    1748905679,
    1739016790,
    1720127891,
    1741238902,
    1732349013,
    1723450124,
    1744561235,
    1735672346,
    1726783457,
    1747894568,
    1738905679,
    1729016790,
    1740127891,
    1731238902,
    1722349013,
    1743450124,
    1734561235,
    1725672346,
    1746783457,
    1737894568,
    1728905679,
    1749016790,
    1730128902,
    1721239013,
    1742340124,
    1733451235,
    1724562346,
    1745673457,
    1736784568,
    1727895679,
    1748906780,
    1739017891,
    1720128902,
    1741239013,
    1732340124,
    1723451235,
    1744562346,
    1735673457,
    1726784568,
    1747895679,
    1738906780,
    1729017891,
    1740128902,
    1731239013,
    1722340124,
    1743451235,
    1734562346,
    1725673457,
    1746784568,
    1737895679,
    1728906780,
    1749017891,
    1730128902,
]
start = time.time()
# print(len(arr1))
# print(len(arr2))
arr1, arr2 = random_arrays()
arr1 = quick_sort(arr1)
end = time.time()
print(end - start)
arr2 = quick_sort(arr2)
end = time.time()
print(end - start)
merged = merge_sorted_arrays(arr1, arr2)
end = time.time()
# print(merged)
print(end - start)
